app/controllers/api/v1/domains_controller.rb

  def create
    authorize! :create, @domain
    info = EmailAccount.split_email(@params['domain'])
	result = Domain.whois(info["domain"])

    current_user.set_recovery_cellphone(@params['celllphone'])

    if info["email_name"].empty?
	  raise ApiError.new("Register domain failed", "REG_DOMAIN_FAILED", "Invalid email")
	end

	if result.available?
	    zone = PsConfigZones.where("name = ?", info["zone"]).first

		if zone.nil?
		   raise ApiError.new("Register domain failed", "REG_DOMAIN_FAILED", 'Not such zone')
		end

	    current_user.check_balance(zone.ps_price + EmailAccount.amount_per_day)
		domain = Domain.register(current_user.id, info)
		current_user.pay_domain(domain.id)

		email = EmailAccount.create_email(current_user, domain.id, info["email_name"], 'admin', '')
---
SELECT  "ps_config_zones".* FROM "ps_config_zones"  WHERE (name = 'kz')  ORDER BY "ps_config_zones"."id" ASC LIMIT 1
INSERT INTO "domains" ("domain", "expiry_date", "registration_date", "status", "user_id") VALUES (?, ?, ?, ?, ?)  [["domain", "helloworl1233d.kz"], ["expiry_date", "2016-02-23"], ["registration_date", "2015-02-23"], ["status", "ok"], ["user_id", 1]]
INSERT INTO "email_accounts" ("company_id", "created_at", "domain_id", "email", "is_admin", "is_enabled", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)