app/controllers/api/v1/groups_controller.rb

  def list
    authorize! :show, @groups
    domain_ids = current_user.domain_ids
    groups = Group.where("domain_id IN (?)", domain_ids)
    info = Array.new()
    groups.each do |group|
      domain = Domain.where('id = ?', group["domain_id"]).first
---
SELECT "groups".* FROM "groups"  WHERE (domain_id IN (9,10))
SELECT  "domains".* FROM "domains"  WHERE (id = 9)  ORDER BY "domains"."id" ASC LIMIT 1

  def info
    info = EmailAccount.split_email(@params['mail'])
    domain = current_user.domains.where('domain = ?', info['domain']).first
    raise ApiError.new("show group failed", "SHOW_GROUP_FAILED", "domain not found") if domain.nil?
    group = Group.where(["email = ? AND domain_id = ?", @params['mail'] ,domain['id']]).first
---
SELECT  "domains".* FROM "domains"  WHERE "domains"."user_id" = ? AND (domain = 'shehhshdhsn.kz')  ORDER BY "domains"."id" ASC LIMIT 1  [["user_id", 9]]
SELECT  "groups".* FROM "groups"  WHERE (email = 'sales@shehhshdhsn.kz' AND domain_id = 9)  ORDER BY "groups"."id" ASC LIMIT 1

  def add
    authorize! :create, @group
    info = EmailAccount.split_email(@params['mail'])
    domain = current_user.domains.where('domain = ?', info['domain']).first
    group = Group.where(["email = ? AND domain_id = ?", @params['mail'] ,domain['id']]).first

	raise ApiError.new("Add emails to group failed", "ADD_EMAILS_TO_GROUP_FAILED", "no such domain or group") if group.nil?
    raise ApiError.new("Add emails to group failed", "ADD_EMAILS_TO_GROUP_FAILED", "emails array empty") if !@params['group_emails'].nil?

	info = []
    @params['group_emails'].each do |group_email|
      group_info = EmailAccount.split_email(group_email)
      email = EmailAccount.where('email = ?', group_email).first
---
SELECT  "domains".* FROM "domains"  WHERE (domain = 'shehhshdhsn.kz')  ORDER BY "domains"."id" ASC LIMIT 1
SELECT  "groups".* FROM "groups"  WHERE (email = 'sales@shehhshdhsn.kz' AND domain_id = 9)  ORDER BY "groups"."id" ASC LIMIT 1
SELECT  "email_accounts".* FROM "email_accounts"  WHERE (email = 'diaz@shehhshdhsn.kz')  ORDER BY "email_accounts"."id" ASC LIMIT 1

  def remove
    authorize! :create, @group
    info = EmailAccount.split_email(@params['mail'])
    domain = current_user.domains.where('domain = ?', info['domain']).first
    group = Group.where(["email = ? AND domain_id = ?", @params['mail'] ,domain['id']]).first

	raise ApiError.new("Add emails to group failed", "ADD_EMAILS_TO_GROUP_FAILED", "no such domain or group") if group.nil?
    raise ApiError.new("Add emails to group failed", "ADD_EMAILS_TO_GROUP_FAILED", "emails array empty") if !@params['group_emails'].nil?

    @params['group_emails'].each do |group_email|
      group_info = EmailAccount.split_email(group_email)
      email = EmailAccount.where('email = ?', group_email).first
---
SELECT  "domains".* FROM "domains"  WHERE (domain = 'shehhshdhsn.kz')  ORDER BY "domains"."id" ASC LIMIT 1
SELECT  "groups".* FROM "groups"  WHERE (email = 'sales@shehhshdhsn.kz' AND domain_id = 9)  ORDER BY "groups"."id" ASC LIMIT 1
SELECT  "email_accounts".* FROM "email_accounts"  WHERE (email = 'diaz@shehhshdhsn.kz')  ORDER BY "email_accounts"."id" ASC LIMIT 1