app/controllers/api/v1/users_controller.rb

  def register
    confirmation_hash = generate_user_hash
    device_token = ''
    device_token = @params['device_token'] unless !@params['device_token'].nil?
    user = User.where('cellphone = ?', @params['cellphone']).first_or_create(:cellphone => @params['cellphone'].strip, :aasm_state => 'register', :device_token => device_token, :internal_credit => 5000)
---
INSERT INTO "users" ("aasm_state", "cellphone", "device_token", "internal_credit") VALUES (?, ?, ?, ?)  [["aasm_state", "register"], ["cellphone", "77772828967"], ["device_token", ""], ["internal_credit", 5000.0]]
SELECT  "users".* FROM "users"  WHERE (cellphone = '77772828967')  ORDER BY "users"."id" ASC LIMIT 1

  def confirm
    user = User.where("cellphone = ?", @params['cellphone']).first
---
SELECT  "users".* FROM "users"  WHERE (cellphone = '77772280108')  ORDER BY "users"."id" ASC LIMIT 1